Autodesk.Revit.DB.SpatialElementTag.SpatialElementTagType
The spatial element tag type.

Autodesk.Revit.DB.SpatialElementTag.SpatialElement
The element that the tag is associated with.
Remarks:
Gives you the SpatialElement (native RoomElem) that this tag is tagging. This may return NULL under some circumstances,
for example when an old-style non-attached detail group with a room tag has been saved out to a file.

Autodesk.Revit.DB.SpatialElementTag.View
The view in which the tag was placed.

Autodesk.Revit.DB.SpatialElementTag.LeaderElbow
The position of the leader's elbow (middle point).
Remarks:
Returns the elbow point of the tag leader.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There is no leader for this tag.
-or-
When setting this property: SpatialElementTag is pinned.
-or-
When setting this property: SpatialElementTag is orphaned.
Since:
2017

Autodesk.Revit.DB.SpatialElementTag.LeaderEnd
The position of the leader's end.
Remarks:
Returns the end point of the tag leader.
Leader end point must be located inside of a room, space or an area.
Use Room.IsPointInRoom or Space.IsPointInSpace method to check whether the leaderEnd is located in the host element or not.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The point is located outside of the spatial element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There is no leader for this tag.
-or-
When setting this property: SpatialElementTag is pinned.
-or-
When setting this property: SpatialElementTag is orphaned.
Since:
2017

Autodesk.Revit.DB.SpatialElementTag.TagHeadPosition
The position of the tag's head.
Remarks:
Returns the end point of the tag leader.
Leader end point must be located inside of a room, space or an area.
Use Room.IsPointInRoom or Space.IsPointInSpace method to check whether the leaderEnd is located in the host element or not.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: Head position of the tag with no leader could not be located outside of the host element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: SpatialElementTag is pinned.
-or-
When setting this property: SpatialElementTag is orphaned.
Since:
2017

Autodesk.Revit.DB.SpatialElementTag.TagText
The text displayed by the tag.
Remarks:
If there are several strings included in the tag, the strings will be returned concatenated.
Since:
2018

Autodesk.Revit.DB.SpatialElementTag.TagOrientation
The orientation of the tag.
Remarks:
See Autodesk::Revit::DB::getSpatialElementTagOrientation for the supported orientations.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2017

Autodesk.Revit.DB.SpatialElementTag.HasElbow
Identifies if the tag's leader has an elbow point or not.
Remarks:
Straight leaders do not have elbow points. Use Autodesk.Revit.DB.SpatialElementTag.LeaderElbow to get or set elbow point.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
There is no leader for this tag.

Autodesk.Revit.DB.SpatialElementTag.HasLeader
Identifies if a leader is displayed for the tag or not.
True if a leader is displayed, otherwise false.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: SpatialElementTag is orphaned.
-or-
When setting this property: Thrown when attempting to turn off leader of the pinned tag
when the tag's head position is located outside off the host element.

Autodesk.Revit.DB.SpatialElementTag.IsTaggingLink
Identifies if the tag has reference to a spatial element in a linked document or not.
Since:
2017

Autodesk.Revit.DB.SpatialElementTag.IsOrphaned
Identifies if the tag is orphaned or not.
Remarks:
The orphan tags are used to tag a spatial element in a link document, but the spatial element was deleted.
Since:
2017

Autodesk.Revit.DB.SpatialElementTag.Location
The location of the tag.
Remarks: Allows you to get and set the location of the tag within the level. The
Z location should be the elevation of the level and is not changeable.

Autodesk.Revit.DB.SpatialElementTag
A tag attached to a SpatialElement (room, space or area) in Autodesk Revit.
Remarks:
SpatialElementTag is the base class for RoomTag, SpaceTag and AreaTag.
Zone tag is not derived from SpatialElementTag. See Autodesk::Revit::DB::IndependentTag for more information.